{"pageProps":{"Post":{"id":"76b6d520-1af3-4484-b5fb-8068b43f1417","contentHtml":"<h2>Life OS</h2>\n<p>After recently listening to <a href=\"https://www.calnewport.com/podcast/\">Cal Newport's - Deep Questions podcast</a> I decided to think more about my system for managing life goals.</p>\n<p>The system suggests the following docs:</p>\n<ul>\n<li>core plan or root plan</li>\n<li>value plans\n<ul>\n<li>personal</li>\n<li>professional</li>\n</ul>\n</li>\n<li>maintenance plan</li>\n<li>progress plan</li>\n</ul>\n<p>This docs is my personal interpretation of that system.</p>\n<h3>Why plan?</h3>\n<p>The reality is that life is measured in years, yet lived by the day, hour, minute, second.</p>\n<p>Life expectancy is up so in my situation, if I'm lucky, I can expect a good 50 years of ... life!</p>\n<p>50 years is a looooooong time without a map of what you care about, what you want to do, where you want to go, and who you want to be.</p>\n<p>To some planning might remove some of the fun from the next few years. I've recently reread the <a href=\"https://waitbutwhy.com/2015/12/the-tail-end.html\">The tail end</a> article from WaitButWhy to make me realise that I plan not to decide what I want to happen, but to make sure that everything I want does happen.</p>\n<p>Professionally, software development is and ever evolving field and as an engineer I need to chart the best course into the future, whilst making sure I'm still relevant now.</p>\n<h3>The ever evolving plan</h3>\n<p>I've used a few methods to carve out this plan in the past. I wanted to outline the resources and current plan I've used so far.</p>\n<p>The one method that I've abused a lot over the years was 'do more of what you like', which explain why I spent more time playing video games, that studying in high school.</p>\n<p>Should we do more of what we like or should we find areas where that selfish goal also has a an altruistic side-effect.</p>\n<p>This is where another great resource came in for me, <a href=\"https://80000hours.org\">80000hours.org</a>. The site highlights the greatest issues facing humanity and informs the reader how to pursue the biggest impact jobs working on those issues.</p>\n<p>I use the guidance from 80000h as a moral compass that allows me to gauge if I'm making an impact.</p>\n<p>For planning I tend to run yearly goals, determined annually in June. I use the <a href=\"https://yearcompass.com\">YearCompass </a> framework to help me reflect on the past year and chart the next.</p>\n<p>For day to day operation I use a Bullet Journal system. Every month I'll use my yearly goals to set monthly aims, and then I daily / weekly aim to spend time towards those goals.</p>\n<p>I usually timebox things in the calendar in order to make sure I do them or spend the time.</p>\n<p>Another important concept to mention are distractions. My aim is to constantly limit distraction to allow more time for working on the plan.</p>\n<h3>Root plan</h3>\n<p>A document where core systems and strategies to organise life are stored. Instead of storing everything in your head - write it down, flesh it out.</p>\n<p>This plan must be generic and should not capture the specific rules.</p>\n<p>The <code>root</code> will point to other more specific documents:</p>\n<h4>Value plan</h4>\n<p>An outline of roles responsibilities and the core values I need to display in those.</p>\n<h4>Personal plan</h4>\n<p>A document on all personal goals and processes.</p>\n<h4>Professional plan</h4>\n<p>A document on all professional goals and processes.</p>\n<h4>Maintenance procedure</h4>\n<p>How do I maintain these systems - when, where, what.</p>\n<p>A good idea here is to think about how data enters the system and how it leaves it.</p>\n<h4>Operational plan</h4>\n<p>How do things get done and what are some of the habits and process you use to achieve the things on the plan.</p>\n<h4>Metrics</h4>\n<p>What are you going to track in order to measure the system.</p>\n","title":"Life OS","url":"life-os","desc":"","updated":1616952440562,"created":1616949439666}},"__N_SSG":true}